Revert to ASCII diagrams in README
